package main

import "fmt"

//iota 是go语言中的常量计数器
//iota会在const关键字出现的时候 iota的值虎重置为0
const (
	n1 = iota //0

	n2 // 1

	n3 // 2
)

//测试 iota 的作用
const (
	A1 = 1
	A2 = iota
	A3
)

//一道题出给自己做的
const (
	v1 = 2
	v2 = 3
	v3 = iota
	v4 = iota
	v5
	v6 = iota
	v7
	//v8 = 8 + 1
	v8
)

func main() {
	fmt.Println(n1, n2, n3)
	fmt.Println(A1, A2, A3)
	//个人预测结果是 2 3 2 3 4 5 6 8
	// const 常量在运行时内存是改变不了的 所以原来的值是不变的
	// 但是iota关键字会统计常量的个数   个人感觉 iota应该在内存不断给没有的赋值的const的常量在赋值
	fmt.Println(v1, v2, v3, v4, v5, v6, v7, v8) //2 3 2 3 4 5 6 8
	//和我预测的结果一样  掌声👏给自己鼓励一下
}
